# EXL_SaveAndCloseBook

## Description
Save and closes the Excel file.

```pascal
FUNCTION EXL_SaveAndCloseBook(filePath : STRING) : BOOLEAN;
```

```python

def vs.EXL_SaveAndCloseBook(filePath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|filePath|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* Excel